app/controllers/students_controller.rb

  def new
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @student = Student.new(post_params(:first_name, :last_name))
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Floci"], ["last_name", "Flocescu"], ["created_at", "2020-05-26 15:58:33.644978"], ["updated_at", "2020-05-26 15:58:33.644978"]]

  def update
    @student = Student.find(params[:id])
    @student.update(post_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Floci edited"], ["last_name", "Flocescu edited"], ["updated_at", "2020-05-26 16:02:15.227931"], ["id", 3]]